[
    {
      "name": "LaRoca2k", 
      "review": "I recently tried CTMK Mobile Detailing and was thoroughly impressed. Their team arrived promptly and efficiently cleaned both the interior and exterior of my car, leaving it looking pristine. I appreciated their customer service and the convenience of having my car washed at home. Overall, I highly recommend CTMK Mobile Detailing for their professionalism and quality service."
    },
    {
      "name": "Amael Mondy", 
      "review": "I recently experienced an exceptional car detailing service at CTMK Mobile Detailing. From the moment I arrived, the attention to detail was evident. The staff was not only professional but also passionate about their work. My car received a thorough cleaning, inside and out, leaving it spotless and rejuvenated. The use of high-quality products and meticulous handiwork showcased their commitment to excellence. I highly recommend CTMK Mobile Detailing for anyone seeking a top-notch car detailing experience."
    },
    {
      "name": "Gustavo Vidal", 
      "review": "Best in the business! Always a pleasure doing business with them. Don’t hesitate to give them a call. You won’t regret it!"
    },
    {
      "name": "J V", 
      "review": "Nice people, 5 stars service. Very meticulous and professional. Really a pleasure doing business with. They did my two cars and booked for my children’s this week. I will call them often, that's for sure."
    },
    {
      "name": "Daniela Edwards", 
      "review": "Exceptional customer service and top-notch detailing! Today I had my car detailed by CTMK and I couldn't be happier! The attention to detail was outstanding, leaving my car looking brand new. The convenience of having it done at my location was a game-changer. Professional, efficient, and worth every penny. Highly recommend! ⭐⭐⭐⭐⭐"
    },
    {
      "name": "Makua Pearson", 
      "review": "CTMK mobile detailing are very professional, always on time and great with communication. I highly recommend them. They’ve been washing all my cars for nearly 9 months now everything has been perfect. Thank you guys so much."
    },
    {
      "name": "Alfre Rosing", 
      "review": "I highly recommend CTMK Mobile Detailing for all your car detailing needs. Their exceptional attention to detail, professionalism, and commitment to customer satisfaction are unmatched. With CTMK, you can trust that your vehicle will receive top-notch care, leaving it looking and feeling brand new. Their mobile service makes it convenient, and their team's expertise ensures a showroom-quality finish. Choose CTMK Mobile Detailing for a car care experience that goes above and beyond your expectations."
    },
    {
      "name": "Nick Barbosa", 
      "review": "Professional, efficient, and high quality service. I find myself purposefully getting my car dirtier quicker so I can call them over again. Goodbye to the days of screaming at my girlfriend for eating in the car, and hello to the days of having a full 3 course meal tucked under my driver’s seat. All because I know for sure these guys will take care of it. Life is good!"
    },
    {
      "name": "Kathy Williams", 
      "review": "CTMK Mobile Detailing came to my work, detailed my entire car and was extremely professional. This service saved me time and money coming to me. My car looks fantastic! I highly recommend them!!!"
    },
    {
      "name": "Carla", 
      "review": "If I could only say two words, I would say thorough and convenient. My car was really dirty and they got all the nooks clean. Also, you can’t get more convenient than having them come to you wherever you are."
    },
    {
      "name": "Alex Stedman", 
      "review": "CTMK is very convenient and they do an amazing job. They made my car look the same as it did brand new inside and out, even getting stains out of my seats that have been there for years. I would highly recommend these guys because they pay attention to detail and make sure the job is complete."
    },
    {
      "name": "Kade Clute", 
      "review": "CTMK delivers quality service that provide top tier car detailing inside and out!! highly recommend"
    },
    {
      "name": "Omar Flores", 
      "review": "Wow, I’m so glad I found these guys to clean my car!!! They went to do one of the world’s best fighters car and that’s how I found out about them! They take their time and get every single little detail !!! I am very satisfied and I highly recommend you try them out. Definitely will contact them to come back soon"
    },
    {
      "name": "Catherine Geary", 
      "review": "Excellent Mobile Car Detailing Service by CTMK Detailing!\nI recently had Mateo from Ctmk Detailing do a mobile car detailing service at my home, and I am beyond impressed. His attention to detail, professionalism, and the convenience of having the service at my doorstep make them the go-to choice. My car looks brand new, and Ctmk Detailing's pricing is very reasonable. I highly recommend Ctmk Detailing for anyone looking for top-notch car detailing!"
    },
    {
      "name": "Edward Punzalan", 
      "review": "Excellent service, came to me quick and got the job done no issues. My trunk was destroyed and they managed to derail every crevasse. Definitely go with the platinum package!"
    },
    {
      "name": "Sebastian Lenis", 
      "review": "Great experience!  They came to my house and washed my car leaving it spotless. Couldn’t have asked for a better job. Thank you!"
    },
    {
      "name": "Guilherme Nogueira", 
      "review": "Amazing service! My car is as clean as its ever been! Thank you guys very much! Highly recommend!"
    },
    {
      "name": "Jessiah contreras", 
      "review": "Great car detailing company! I love that new car feeling and these guys made it happen. Will definitely refer friends here in South Florida!"
    },
    {
      "name": "Jaylan Claudio", 
      "review": "BEST SERVICE!!!! YOU WONT BE DISAPPOINTED!!!!!"
    },
    {
      "name": "Yoraco Gonzalez", 
      "review": "The way this company cleaned my fleet of vehicles set the standard of car detailing higher for me. Highly recommend them."
    }
  ]